#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["rapidapi-genius-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-rapidapi-genius-api-extracts]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["rapidapi-genius-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-rapidapi-genius-api-extracts/roles/storage.objectAdmin]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_project_service.cloud_sql_api will be created
  + resource "google_project_service" "cloud_sql_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.composer_api will be created
  + resource "google_project_service" "composer_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (sensitive value)
      + service            = "composer.googleapis.com"
    }

  # google_project_service.container_api will be updated in-place
  ~ resource "google_project_service" "container_api" {
        id                 = "exemplary-tide-379122/container.googleapis.com"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ project            = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # google_project_service.secret_mgr_api will be updated in-place
  ~ resource "google_project_service" "secret_mgr_api" {
        id                 = "exemplary-tide-379122/secretmanager.googleapis.com"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ project            = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # module.gcs_api_extract.google_storage_bucket.buckets["rapidapi-genius-api-extracts"] will be destroyed
  # (because key ["rapidapi-genius-api-extracts"] is not in for_each map)
  - resource "google_storage_bucket" "buckets" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "pricing-aggregator-us-east1-rapidapi-genius-api-extracts" -> null
      - labels                      = {
          - "name"              = "pricing-aggregator-us-east1-rapidapi-genius-api-extracts"
          - "project_name"      = "pricing-aggregator"
          - "project_workspace" = "exemplary-tide-379122"
        } -> null
      - location                    = "US-EAST1" -> null
      - name                        = "pricing-aggregator-us-east1-rapidapi-genius-api-extracts" -> null
      - project                     = "exemplary-tide-379122" -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/pricing-aggregator-us-east1-rapidapi-genius-api-extracts" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://pricing-aggregator-us-east1-rapidapi-genius-api-extracts" -> null

      - versioning {
          - enabled = false -> null
        }
    }

  # module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name"              = "pricing-aggregator-us-east1-spotify-web-api-extracts"
          + "project_name"      = "pricing-aggregator"
          + "project_workspace" = (sensitive value)
        }
      + location                    = "US-EAST1"
      + name                        = "pricing-aggregator-us-east1-spotify-web-api-extracts"
      + project                     = (sensitive value)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.gcs_api_extract.google_storage_bucket_iam_binding.admins["rapidapi-genius-api-extracts"] will be destroyed
  # (because key ["rapidapi-genius-api-extracts"] is not in for_each map)
  - resource "google_storage_bucket_iam_binding" "admins" {
      - bucket  = "b/pricing-aggregator-us-east1-rapidapi-genius-api-extracts" -> null
      - id      = "b/pricing-aggregator-us-east1-rapidapi-genius-api-extracts/roles/storage.objectAdmin" -> null
      - members = [] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket = "pricing-aggregator-us-east1-spotify-web-api-extracts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

Plan: 4 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*